Tekla Open API Reference for Tekla Structures 2025
Text Constructor
Overload List
Name | Description
Text(ViewBase, Point, String)
 Creates a new text instance with the given text string.
Text(ViewBase, Point, String, PlacingBase)
 Creates a new text instance with the given text string using a specific placing type.
Text(ViewBase, Point, String, Text.TextAttributes)
 Creates a new text instance with the given text string and text attributes.
Text(ViewBase, Point, String, PlacingBase, Text.TextAttributes)
 Creates a new text instance with the given text string and text attributes using a specific placing type.
Top
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace